//  ประมาณ  7 นาที
#include<bits/stdc++.h>
using namespace std;
int main(){
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int n;
    cin>>n;
    for(int t=0;t<n;t++){
    int sum=405;
    for(int i=1;i<=9;i++){
        string s; cin>>s;
        for(int j=1;j<=9;j++){
            sum-=s[j-1]-'0';
            if(s[j-1]=='0') sum+=j*100+i*10;
        }
    }
    cout<<sum<<"\n";
}
    return 0;
}
/*
1
123456789
456789123
789123456
214365897
367894512
598271634
672538941
945612378
831907065

output :
1386
*/
/*
2
123456789
456089123
789123456
214365897
367894215
895271634
571638942
942517360
638942571
123456789
456709123
789123456
214365897
365897214
897210365
538941672
642578931
971632548

output :
1415
1192
*/